<template>
  <ve-line :data="chartData" />
</template>

<script>
export default {
  data: function() {
    return {
      chartData: {
        columns: ['日期', '登录数量', '注册数量'],
        rows: [
          { 日期: '12/1', 登录数量: 1393, 注册数量: 12380 },
          { 日期: '12/2', 登录数量: 3530, 注册数量: 240 },
          { 日期: '12/3', 登录数量: 2923, 注册数量: 13045 },
          { 日期: '21/4', 登录数量: 1723, 注册数量: 4350 },
          { 日期: '12/5', 登录数量: 3792, 注册数量: 2900 },
          { 日期: '12/6', 登录数量: 4593, 注册数量: 1405 }
        ]
      }
    }
  }
}
</script>
