<template>
  <ve-line :data="chartData" :settings="chartSettings"></ve-line>
</template>

<script>
export default {
  data() {
    this.chartSettings = {
      stack: { 数量: ["访问数量", "点击数量"] },
      area: true
    };
    return {
      chartData: {
        columns: ["日期", "访问数量", "点击数量", "点击率"],
        rows: [
          { 日期: "11/27", 访问数量: 1393, 点击数量: 1093, 点击率: 0.32 },
          { 日期: "11/28", 访问数量: 1723, 点击数量: 1423, 点击率: 0.49 },
          { 日期: "11/29", 访问数量: 1393, 点击数量: 1093, 点击率: 0.32 },
          { 日期: "11/30", 访问数量: 1393, 点击数量: 1093, 点击率: 0.32 },
          { 日期: "12/1", 访问数量: 1393, 点击数量: 1093, 点击率: 0.32 },
          { 日期: "12/2", 访问数量: 3530, 点击数量: 3230, 点击率: 0.26 },
          { 日期: "12/3", 访问数量: 2923, 点击数量: 2623, 点击率: 0.76 },
          { 日期: "12/4", 访问数量: 1723, 点击数量: 1423, 点击率: 0.49 },
          { 日期: "12/5", 访问数量: 3792, 点击数量: 3492, 点击率: 0.323 },
          { 日期: "12/6", 访问数量: 4593, 点击数量: 4293, 点击率: 0.78 }
        ]
      }
    };
  }
};
</script>